API_HH/app/controllers/api/v1/companies_controller.rb

  def index
    if params[:job_id]
      @companies = Job.find(params[:job_id]).jobs
    else
      @companies = Company.all
---
SELECT "companies".* FROM "companies"

  def create
    @company = Company.new(company_params)
    if @company.save
---
INSERT INTO "companies" ("name", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Delta"], ["location", "SPb"], ["created_at", "2022-09-30 08:03:21.221903"], ["updated_at", "2022-09-30 08:03:21.221903"]]

  def destroy
    #@company.destroy
    #render json: { deleted_company: @company,
    #               code: 200,
    #               status: :success,
    #}, except: [:created_at, :updated_at]
    company = Company.find(params[:id])

    puts "deleted: @company = #{company}"

    if company.deleted
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 5]]