API_HH/app/graphql/types/mutation_type.rb

INSERT INTO "companies" ("name", "location", "created_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Adidas"], ["location", "Piter"], ["created_at", "2022-11-13 19:02:19.099779"]]
---
    def create_company(name:, location:)
      Company.create(name: name, location: location )