API_HH/app/graphql/types/query_type.rb

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def company(id:)
      Company.find(id)