API_HH/app/models/company.rb

UPDATE "companies" SET "updated_at" = $1, "deleted" = $2 WHERE "companies"."id" = $3  [["updated_at", "2022-09-18 19:32:02.754958"], ["deleted", true], ["id", 6]]
---
  def delete_company
    self.update(deleted: true)